# Выпускной проект. SQL

## Введение

Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.

Наша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Моя первая задача как аналитика — проанализировать базу данных.

В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

### Цель

- Посчитать, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитать количество обзоров и среднюю оценку;
- Определить издательство, которое выпустило наибольшее число книг толще 50 страниц — так мы исключим из анализа брошюры;
- Определить автора с самой высокой средней оценкой книг — учитываем только книги с 50 и более оценками;
- Посчитаем среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

### Исходные данные

В нашем распоряжении несколько датасетов:

**Таблица `books`** - Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`** - Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`** - Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`** - Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`** - Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

## Шаг 1. Подключение к БД

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import text, create_engine

# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Шаг 2. Изучение и подготовка данных

In [2]:
datasets = ['books', 'authors', 'publishers', 'ratings', 'reviews']
datasets_name = ['books', 'authors', 'publishers', 'ratings', 'reviews']

In [3]:
for i, df_name in enumerate(datasets):
    query = f"SELECT * FROM {df_name}"
    request = pd.io.sql.read_sql(query, con=engine)
    
    print(f'Таблица - "{datasets_name[i]}"')
    display(request.head())
    print(request.info())
    
    print('\n-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/\n')

Таблица - "books"

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB
None

-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/

Таблица - "authors"

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB
None

-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/

Таблица - "publishers"

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB
None

-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/

Таблица - "ratings"

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB
None

-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/

Таблица - "reviews"

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB
None

-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/

## Задача 1. Cколько книг вышло после 1 января 2000 года;

In [4]:
query = '''
    SELECT COUNT(*)
    FROM books
    WHERE CAST(publication_date AS TIMESTAMP) > CAST('2000-01-01' AS TIMESTAMP)
    '''

request = pd.io.sql.read_sql(query, con = engine)

print('После 1 января 2020 года вышло', request.loc[0, 'count'], 'книг')

После 1 января 2020 года вышло 819 книг

## Задача 2. Количество обзоров и средняя оценка

In [5]:
query = '''
    SELECT b.book_id,
           b.title,
           a.author AS author,
           COUNT(DISTINCT r.review_id) AS count_review,
           ROUND(AVG(rat.rating), 2) AS avg_rating
    FROM books AS b
    LEFT JOIN reviews AS r ON r.book_id = b.book_id
    LEFT JOIN ratings AS rat ON rat.book_id = b.book_id
    LEFT JOIN authors AS a ON a.author_id = b.author_id
    GROUP BY b.book_id, b.title, a.author
    ORDER BY count_review DESC
    '''

request = pd.io.sql.read_sql(query, con = engine)
request.columns = ['Уникальный идентификатор', 'Название книги', 'Автор книги', 'Кол-во обзоров', 'Средний рейтинг']
request

,Уникальный идентификатор,Название книги,Автор книги,Кол-во обзоров,Средний рейтинг
0,948,Twilight (Twilight #1),Stephenie Meyer,7,3.66
1,963,Water for Elephants,Sara Gruen,6,3.98
2,734,The Glass Castle,Jeannette Walls,6,4.21
3,302,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling/Mary GrandPré,6,4.41
4,695,The Curious Incident of the Dog in the Night-Time,Mark Haddon,6,4.08
...,...,...,...,...,...
995,83,Anne Rice's The Vampire Lestat: A Graphic Novel,Faye Perozich/Anne Rice/John Bolton/Daerick Gröss,0,3.67
996,808,The Natural Way to Draw,Kimon Nicolaides/Mamie Harmon,0,3.00
997,672,The Cat in the Hat and Other Dr. Seuss Favorites,Dr. Seuss/Various,0,5.00
998,221,Essential Tales and Poems,Edgar Allan Poe/Benjamin F. Fisher,0,4.00
999,191,Disney's Beauty and the Beast (A Little Golden...,Teddy Slater/Ron Dias/Ric González,0,4.00

<b>Вывод:</b>
В Топ-3 по кол-ву обзоров и средней оценке попадают следующие книги:
- "Twilight (Twilight #1)" - кол-во обзоров `7`, средняя оценка `3.66`;
- "Water for Elephants" - кол-во обзоров `6`, средняя оценка `3.98`;
- "The Glass Castle	" - кол-во обзоров `6`, средняя оценка `4.21`.

## Задача 3. Издательство

- Определим издательство, которое выпустило наибольшее число книг толще 50 страниц — так мы исключим из анализа брошюры;

In [6]:
query = '''
    SELECT p.publisher,
                 COUNT(DISTINCT b.book_id) AS count_books
    FROM publishers AS p
    INNER JOIN books AS b ON b.publisher_id = p.publisher_id
    WHERE num_pages > 50
    GROUP BY p.publisher
    ORDER BY count_books DESC
    LIMIT 1
    '''

request = pd.io.sql.read_sql(query, con = engine)
request.columns = ['Издательство', 'Кол-во книг']
request

    Издательство  Кол-во книг
0  Penguin Books           42

## Задача 4. Автор

- Определим автора с самой высокой средней оценкой книг — учитываем только книги с 50 и более оценками;

In [7]:
query = '''
        SELECT a.author,
                    ROUND(AVG(r.rating), 2) avg_rating
        FROM authors AS a
        
        JOIN books AS b ON a.author_id=b.author_id
        JOIN ratings AS r ON b.book_id=r.book_id
        
        WHERE b.book_id IN(SELECT b.book_id
                                          FROM books AS b
                                          JOIN ratings AS r ON b.book_id=r.book_id
                                          GROUP BY b.book_id
                                          HAVING count(r.rating_id)>=50)
        GROUP BY a.author
        ORDER BY avg_rating desc

        LIMIT 1
        '''

request = pd.io.sql.read_sql(query, con = engine)
request.columns = ['Автор', 'Средний рейтинг']
request

                        Автор  Средний рейтинг
0  J.K. Rowling/Mary GrandPré             4.29

## Задача 5. Среднее кол-во обзоров от пользователей

Посчитаем среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [8]:
query = '''
        SELECT SUM (COUNT) / COUNT(COUNT) AS avg
        FROM (SELECT username,
                                count(review_id)
                    FROM reviews
                    WHERE username IN (SELECT username
                                                       FROM ratings
                                                       GROUP BY username
                                                       HAVING count(rating_id)>48)
                    GROUP BY username) AS new_data
        '''

request = pd.io.sql.read_sql(query, con = engine)
print ('Среднее кол-во обзоров от пользователей', request.loc[0, 'avg'])

Среднее кол-во обзоров от пользователей 24.0

# Выводы

По полученным данным нам удалось получить следующие решения и итоговые цифры:
- После 1 января 2020 года вышло 819 книг;
- В Топ-3 по кол-ву обзоров и средней оценке попадают следующие книги:
    - "Twilight (Twilight #1)" - кол-во обзоров `7`, средняя оценка `3.66`;
    - "Water for Elephants" - кол-во обзоров `6`, средняя оценка `3.98`;
    - "The Glass Castle	" - кол-во обзоров `6`, средняя оценка `4.21`.
- среди всех издательств самым продуктивным является `Penguin Books`, оно выпустило	`42` книги;
- среди всех авторов книг с 50 и более оценками на первое место попадает `J.K. Rowling/Mary GrandPré` со средней оценкой `4.29`;
- среднее кол-во обзоров от пользователей 24.0.